<?php
/*************************************
 * Этот файл является частью Kotoba. *
 * Файл license.txt содержит условия *
 * распространения Kotoba.           *
 *************************************/
/*********************************
 * This file is part of Kotoba.  *
 * See license.txt for more info.*
 *********************************/
// Сообщения на русском языке для записи в лог.

/*********************************************
 * Активность администраторов и модераторов. *
 *********************************************/

// Параметры: id пользователя, ip адрес.
Logging::$messages['ADMIN_FUNCTIONS_EDIT_GROUPS'] = 'Задействовано редактирование групп пользователей. Администратор %s IP %s';
// Параметры: id пользователя, ip адрес.
Logging::$messages['ADMIN_FUNCTIONS_EDIT_USER_GROUPS'] = 'Задействовано редактирование принадлежности пользователей группам. Администратор %s IP %s';
// Параметры: id пользователя, ip адрес.
Logging::$messages['ADMIN_FUNCTIONS_EDIT_ACL'] = 'Задействовано редактирование списка контроля доступа. Администратор %s IP %s';
// Параметры: id пользователя, ip адрес.
Logging::$messages['THREADS_EDIT_FUNCTIONS'] = 'Задействован фукнционал для редактирования нитей. Пользователь %s IP %s';
// Параметры: id пользователя, ip адрес.
Logging::$messages['ADMIN_FUNCTIONS_EDIT_LANGUAGES'] = 'Задействовано редактирование языков. Администратор %s IP %s';
// Параметры: id пользователя, ip адрес.
Logging::$messages['ADMIN_FUNCTIONS_EDIT_STYLESHEETS'] = 'Задействовано редактирование стилей оформления. Администратор %s IP %s';
// Параметры: id пользователя, ip адрес.
Logging::$messages['ADMIN_FUNCTIONS_EDIT_CATEGORIES'] = 'Задействовано редактирование категорий досок. Администратор %s IP %s';
// Параметры: id пользователя, ip адрес.
Logging::$messages['ADMIN_FUNCTIONS_EDIT_UPLOAD_HANDLERS'] = 'Задействовано редактирование обработчиков загружаемых файлов. Администратор %s IP %s';
// Параметры: id пользователя, ip адрес.
Logging::$messages['ADMIN_FUNCTIONS_EDIT_POPDOWN_HANDLERS'] = 'Задействовано редактирование обработчиков удаления нитей. Администратор %s IP %s';
// Параметры: id пользователя, ip адрес.
Logging::$messages['ADMIN_FUNCTIONS_EDIT_UPLOAD_TYPES'] = 'Задействовано редактирование типов загружаемых файлов. Администратор %s IP %s';
// Параметры: id пользователя, ip адрес.
Logging::$messages['ADMIN_FUNCTIONS_EDIT_BOARD_UPLOAD_TYPES'] = 'Задействовано редактирование связей загружаемых типов файлов с досками. Администратор %s IP %s';
// Параметры: id пользователя, ip адрес.
Logging::$messages['ADMIN_FUNCTIONS_EDIT_BOARDS'] = 'Задействовано редактирование досок. Администратор %s IP %s';
// Параметры: id пользователя, ip адрес.
Logging::$messages['ADMIN_FUNCTIONS_EDIT_BANS'] = 'Задействовано редактирование банов. Администратор %s IP %s';
// Параметры: id пользователя, ip адрес.
Logging::$messages['MOD_FUNCTIONS_EDIT_BANS'] = 'Задействовано редактирование банов. Модератор %s IP %s';

/***********
 * Разное. *
 ***********/

// Параметры: id пользователя, ip адрес.
Logging::$messages['EDIT_THREADS'] = 'Задействовано редактирование настроек нитей. Пользователь %s IP %s';
?>